## Staging: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| update | `module.url_shortener_lambda.aws_iam_policy.policies[0]` |
|        | `module.url_shortener_lambda.aws_lambda_function.this`   |
| add    | `aws_ssm_parameter.notify_api_key`                       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/api_auth_token",
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/hashing_peppers",
              + (known after apply),
            ]
        }
    }

  # aws_ssm_parameter.notify_api_key will be created
  + resource "aws_ssm_parameter" "notify_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "notify_api_key"
      + tags           = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.url_shortener_lambda.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::843973686572:policy/url-shortener-api-0"
        name      = "url-shortener-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/hashing_peppers",
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/api_auth_token",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.url_shortener_lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "url-shortener-api"
        tags                           = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "API_AUTH_TOKEN_SECRET_ARN"  = "arn:aws:ssm:ca-central-1:843973686572:parameter/api_auth_token" -> null
              + "NOTIFY_MAGIC_LINK_TEMPLATE" = "c8520014-597f-4e73-8eef-baf3f5835596"
                # (3 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
